## Pandas with SQLite

In [1]:
import pandas as pd
import sqlite3
import warnings
warnings.filterwarnings("ignore")

##Â Create a connection

In [2]:
conn = sqlite3.connect("practice.db")
cur = conn.cursor()

In [3]:
cur.execute("SELECT * FROM customer")
cur.fetchall()

[('Sumit', 'Kumar', 0.0),
 ('Golu', 'Singh', 100000.0),
 ('Sri', 'Ambati', 3000.0),
 ('Sandeep', 'Desai', 20000.0),
 ('Anu', 'Gaur', 4020.5)]

## Creation of a Dataframe (Pandas)

In [4]:
df = pd.read_sql_query("SELECT * FROM customer", conn)

In [5]:
df

  first_name last_name    income
0      Sumit     Kumar       0.0
1       Golu     Singh  100000.0
2        Sri    Ambati    3000.0
3    Sandeep     Desai   20000.0
4        Anu      Gaur    4020.5

## Run queries from Pandas

In [6]:
pd.read_sql("select * from customer", conn)

  first_name last_name    income
0      Sumit     Kumar       0.0
1       Golu     Singh  100000.0
2        Sri    Ambati    3000.0
3    Sandeep     Desai   20000.0
4        Anu      Gaur    4020.5

In [7]:
pd.read_sql("select * from customer where first_name = 'Sumit'", conn)

  first_name last_name  income
0      Sumit     Kumar     0.0

In [8]:
pd.read_sql("select first_name, last_name from customer", conn)

  first_name last_name
0      Sumit     Kumar
1       Golu     Singh
2        Sri    Ambati
3    Sandeep     Desai
4        Anu      Gaur

In [9]:
pd.read_sql("select first_name, last_name from customer order by last_name", conn)

  first_name last_name
0        Sri    Ambati
1    Sandeep     Desai
2        Anu      Gaur
3      Sumit     Kumar
4       Golu     Singh

## Read CSV file from Pandas

In [10]:
pd.read_csv("sample.csv")

  first_name  Age
0      Sumit   25
1       Golu   21
2        Sri   60
3        Anu   58
4    Sandeep   28

In [11]:
sample_df = pd.read_csv("sample.csv")

In [12]:
type(sample_df)

pandas.core.frame.DataFrame

In [13]:
sample_df.head(2)

  first_name  Age
0      Sumit   25
1       Golu   21

## Creating a table in SQLite from a CSV file with Pandas

In [14]:
sample_df = pd.read_csv("sample.csv")

In [15]:
sample_df.to_sql("sample_table", conn, if_exists="replace", index=False)

In [16]:
pd.read_sql("select * from sample_table", conn)

  first_name  Age
0      Sumit   25
1       Golu   21
2        Sri   60
3        Anu   58
4    Sandeep   28

In [17]:
sample_df.columns

Index(['first_name', 'Age'], dtype='object')

## Function to get all the tables info

In [18]:
conn = sqlite3.connect("practice.db")
cur = conn.cursor()

In [19]:
def table_info(conn,cursor):
    """
    prints out all of the columns of every table in the DB.
    conn: database connection object
    cursor: cursor object
    
    """
    
    tables = cur.execute("SELECT name FROM sqlite_master WHERE type='table';").fetchall()
    for table_name in tables:
        table_name = table_name[0]
        table = pd.read_sql_query("SELECT * from {} LIMIT 0".format(table_name), conn)
        print(table_name)
        for col in table.columns:
            print("\t "+ col)
            print()

In [20]:
table_info(conn,cur)

customer
	 first_name

	 last_name

	 income

sample_table
	 first_name

	 Age

## Schema with SQlite

In [21]:
cur.execute("PRAGMA table_info('customer')").fetchall()

[(0, 'first_name', 'TEXT', 0, None, 0),
 (1, 'last_name', 'TEXT', 0, None, 0),
 (2, 'income', 'REAL', 0, None, 0)]

Every row includes:

- Index of the column
- Column Name
- Data type
- Whether or not the column can be NULL
- The default value for the column
- The primary key in the result is 0 for columns that are not the primary key